---
title: WorksetId
classe: Autodesk.Revit.DB.WorksetId
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# WorksetId

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 IntegerValue { get; }` | `worksetId.IntegerValue` | Int32 |
| `WorksetId InvalidWorksetId { get; }` | `WorksetId.InvalidWorksetId` | WorksetId |
| `Int32 Compare(WorksetId)` | `worksetId.Compare(id)` | Int32 |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```